{
  "main": {
    "name":"Taber Fisher",
    "occupation":"Software Engineer",
    "description":"I have a passions for Artifical Intellegence, Space Exploration, History, Rock Climbing, Photography, and the Environment",
    "image":"profilepic.jpg",
    "bio":"I am a senior studying Computer Science at Virginia Tech. Most of my experince is using Machine Learning and Artifical Intellegence to tackle difficult problems. The languages I am most comfortable with are Python, Java, C#, and JavaScript.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "taberf@vt.edu",
    "phone": "555-555-5555",
    "address":{
      "street":"700 Washington Street SW",
      "city":"Blacksburg",
      "state":"Virginia",
      "zip": "24061"
    },
    "website": "https://www.linkedin.com/in/taber-fisher-979a07113/",
    "resumedownload":"./images/TaberFisherResume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/taber-fisher-979a07113/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/eltabre/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/eltabre",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"Virginia Tech",
        "degree":"Computer Science",
        "graduated":"December 2019",
        "description":"Majoring in Computer Science with a Mathematics Minor. Studied abroad during Spring of 2016 with the Presidential Global Scholars program in Riva San Vitale, Switzerland."
      }
    ],
    "work":[
      {
        "company":"Lockheed Martin",
        "title":"Software Development Intern",
        "years":"May 2018 - Present",
        "description":"This year, I worked with Generative Adversarial Networks (GANs) to generate data to enlarge datasets that are too small for computer vision training. I also designed a text summarization program that will ingest articles and generate summaries for corporate scouting. Last summer, I created image recognition software that used TensorFlow for vehicle detection on satellite and aerial imagery with an accuracy of 98 percent, as well as developing a proof-of-concept recommendation algorithm to assist users in choosing overlays to place on maps."
      },
      {
        "company":"Rocketry at Virgina Tech",
        "title":"Lead Software Architect",
        "years":"September 2016 - September 2019",
        "description":"On this team, I personally worked on developing a real-time object recognition algorithm that will work during the rocket's flight. I have also helped to design active drag system software in C++ so our rocket hit an exact target height, author a safety report on Hybrid Rocket Engines (HRE) so the team could begin development on construction of our own HRE for the IREC competition, and create the new team website."
      },
      {
        "company":"AMC Theatres",
        "title":"Applications & Data Systems Intern",
        "years":"May 2016 - August 2016, May 2017 - August 2017",
        "description":"I created and presented a movie recommendation engine in Python to upper level management that is undergoing testing for worldwide implementation on the AMC website. I also built an app in C# that streamlined the process for adding new members to the AMC Stubs program. Lastly I, utilized React.js, Relay, and GraphQL to design multiple features on the AMC website, including making the site more handicap accessible, modernizing the search bar, and hybridizing the ticket purchasing page."
      }
    ],
    "research":[
      {
        "company":"Assistive Robotics Lab (ARL)",
        "title":"Undergraduate Researcher",
        "years":"August 2018 - Present",
        "description":"In this lab, I am researching gait prediction. I comparing different machine learning algorithms, such as K-nearest neighbors and support vector machines, and deep learning modles, for example dense neural networks and long-short term memory (LTSM), to find what algorithm will work the most efficiently with the highest accuracy."
      },
      {
        "company":"Neural Dynamics Lab",
        "title":"Undergraduate Researcher",
        "years":"April 2018 - May 2019",
        "description":"At the Nueral Dynamics Lab I helped with studying different deep learning approaches to classifing EEG and iEEG data for brain-computer interface tasks. We published \"A comparative study of motor imagery based BCI classifiers on EEG and iEEG Data\" in GlobalSIP 2019 proceedings."
      },
      {
        "company":"Software Innovations Lab",
        "title":"Undergraduate Researcher",
        "years":"November 2017 - August 2018",
        "description":"The team I was a part of won 2nd place at Virginia Tech Undergraduate Computer Science Symposium for research in creating a musical score search engine that should search MusicXML files."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"Java",
        "level":"55%"
      },
      {
        "name":"MATLAB",
        "level":"50%"
      },
      {
        "name":"JavaScript",
        "level":"90%"
      },
      {
        "name":"C#",
        "level":"80%"
      },
      {
        "name":"Git",
        "level":"50%"
      },
      {
        "name":"C",
        "level":"80%"
      },
      {
        "name":"Mathematica",
        "level":"80%"
      },
      {
        "name":"Agile",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"PolitiGauge",
        "category":"A Data Sciene project turned into Chrome Extension tyring to detect poltical bias in articles",
        "image":"politigauge.png",
        "url":"https://github.com/eltabre/PolitiGauge"
      },
      {
        "title":"Rocketry@VT Github",
        "category":"A team repository where the machine learning that I do on rockets is housed",
        "image":"rocketryicon.png",
        "url":"https://github.com/RocketryVT"
      },
      {
        "title":"Rocketry@VT Website",
        "category":"The Website that I helped design and build for my rocketry team",
        "image":"rocketryicon.png",
        "url":"https://github.com/RocketryVT"
      }
    ]
  }
}
